Revit 2026 API

# CurveByPointsArrayIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CurveByPointsArrayIterator()
```
```vb
Public Sub New
```
```cpp
public:
CurveByPointsArrayIterator()
```
```fsharp
new : unit -> CurveByPointsArrayIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

CurveByPointsArrayIterator Class

Autodesk.Revit.DB Namespace